tutorials/incompressible/simpleSolver/ras/ACCM_airFoil2D/0/U
/*---------------------------------------------------------------------------*\
Caelus 9.04
 Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (52.077 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (52.077 0 0);
    }
    left
    {
        type            empty;
    }
    outlet
    {
        type            zeroGradient;
    }
    right
    {
        type            empty;
    }
    wall
    {
        type            noSlipWall;
    }
}


// ************************************************************************* //
