tutorials/incompressible/simpleSolver/ras/ACCM_airFoil2D/system/controlDict
/*-------------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/
FoamFile
{
   version          2.0;
   format           ascii;
   class            dictionary;
   location         "system";
   object           controlDict;
}
//-------------------------------------------------------------------------------

application         simpleSolver;

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             10000; // increase endTime to atleast 50000 for validation cases

deltaT              1;

writeControl        runTime;

writeInterval       1000;

purgeWrite          2;

writeFormat         ascii;

writePrecision      12;

writeCompression    true;

timeFormat          general;

timePrecision       6;

runTimeModifiable   true;

//-------------------------------------------------------------------------------

// Function Objects to obtain forces

functions
{
    forces
    {
        type            forces;

        functionObjectLibs ("libforces.so");
        patches         ( wall );
        CofR            (0 0 0);
        rhoName         rhoInf;
        rhoInf          2.15527;
        writeControl    timeStep;
        writeInterval   50;
    }
}
