tutorials/incompressible/simpleSolver/ras/ACCM_airFoil2D/system/fvSchemes
/*-------------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSchemes;
}
//------------------------------------------------------------------------------

ddtSchemes
{
   default              steadyState;
}

gradSchemes
{
   default              Gauss linear;
}

divSchemes
{
   default              none;
   div(phi,U)           Gauss linearUpwindBJ grad(U);
   div(phi,nuTilda)     Gauss upwind;
   div(phi,k)           Gauss upwind;
   div(phi,omega)       Gauss upwind;
   div((nuEff*dev(T(grad(U))))) Gauss linear;
   div(phi,symm(grad(U))) Gauss linear;
}

laplacianSchemes
{
   default              none;
   laplacian(nu,U)      Gauss linear corrected;
   laplacian(nuEff,U)   Gauss linear corrected;
   laplacian(DnuTildaEff,nuTilda) Gauss linear corrected;
   laplacian(DkEff,k) Gauss linear corrected;
   laplacian(DomegaEff,omega) Gauss linear corrected;
   laplacian(rAUf,p)    Gauss linear corrected;
   laplacian(1,p)       Gauss linear corrected;
}

interpolationSchemes
{
   default              linear;
   interpolate(HbyA)    linear;
}

snGradschemes
{
   default              corrected;
}


